MJBina/LPC/dsPIC/src/common/CAN/rv_can.c
// <><><><><><><><><><><><><> rv_can.c <><><><><><><><><><><><><><><><><><><><><><>
//-----------------------------------------------------------------------------
//  Copyright(C) 2015 - Sensata Technologies, Inc.  All rights reserved.
//-----------------------------------------------------------------------------
//
//  RV-C CAN bus protocol 
//  
//-----------------------------------------------------------------------------

// --------
// headers
// --------
#include "options.h"    // must be first include
#include "analog.h"
#include "charger.h"
#include "charger_cmds.h"
#include "config.h"
#include "dsPIC33_CAN.h"
#include "inverter.h"
#include "inverter_cmds.h"
#include "rv_can.h"
#include "sensata_can.h"
#include "nvm.h"
#include "hs_temp.h"
#include "tasker.h"


// ----------------------------------------------------------------------
//                  B A S I C    M E S S A G E S
// ----------------------------------------------------------------------

// is given instance for this device
// returns 0=no, 1=cmd is for me,
int IsRvcCmdForMe(uint8_t instance)
{
    if (instance == g_can.MyInstance) return(1);
    if (instance == RVC_BROADCAST_INSTANCE) return(1);
    return(0);
}

// ----------------------------------------------------------------------
static int8_t s_rvcProductIdStr[100] = { "Sensata*" MODEL_NO_STRING "***" };  // default; gets written over

// build the RVC product ID string
// contains serial number so needs to be build from mfg data
void rvcan_BuildProductId()
{
    // Make*Model*SerialNum*Ver*   must be separated by astericks   RVC 3.2.8
    sprintf(s_rvcProductIdStr, "Sensata*%s*%s*%s*", g_RomMfgInfo.model_no, g_RomMfgInfo.serial_no, g_RomMfgInfo.rev);
    LOG(SS_CAN, SV_INFO, "ProductId: '%s'", s_rvcProductIdStr);
}

// ----------------------------------------------------------------------
// returns the RVC/J1939 product id string
uint8_t* rvcan_GetProductIdString()
{
    //  must be separated by astericks
    return((uint8_t*)s_rvcProductIdStr);
}

// ----------------------------------------------------------------------
// RVC 3.3.4  pg 22
// send manufacturer specific claim request
void rvcan_SendMfgAddressClaimRequest(uint16_t mfgCode)
{
    CAN_DATA data[2];
    CAN_LEN  ndata = sizeof(data);

    data[0] = (mfgCode & 0x7);
    data[1] = (mfgCode >> 3) & 0xFF;

    LOGX(SS_J1939, SV_INFO, "SendMfgAddressClaimReq: ", data, ndata);

    J1939_SendMessage(RVC_DGN_MFG_SPECIFIC_CLAIM_REQUEST, ndata, data);
}

// ----------------------------------------------------------------------
// RVC 3.2.5.1
// Send Diagnostics DM_RV message
void rvcan_Send_DM_RV()
{
    CAN_DATA data[sizeof(RVCS_DM_RV)];
    CAN_LEN  ndata = sizeof(data);

    inv_GetDM_RV((RVCS_DM_RV*)&data);

    LOGX(SS_J1939, SV_INFO, "Send_DM_RV: ", data, ndata);

    J1939_SendMessage(RVC_DGN_DM_RV, ndata, data);
}

// ----------------------------------------------------------------------
// RVC 3.2.5.1
// Send Generic Config Status
void rvcan_SendGenericCfgStatus()
{
    CAN_DATA data[sizeof(RVCS_GENERIC_CFG_STATUS)];
    CAN_LEN  ndata = sizeof(data);
    RVCS_GENERIC_CFG_STATUS* status = (RVCS_GENERIC_CFG_STATUS*)&data[0];

    // TODO set these
    status->mfgCodeLSB   = 0;  
    status->mfgCodeMSG   = 0;   
    status->funcInstance = 0;  
    status->function     = 0;     
    status->fwRevision   = 0;   
    status->cfgTypeLSB   = 0;   
    status->cfgTypeISB   = 0;   
    status->cfgTypeMSB   = 0;   
    status->cfgRevision  = 0;  

    J1939_SendMessage(RVC_DGN_GENERIC_CONFIGURATION_STATUS, ndata, data);
}

// ----------------------------------------------------------------------
// RVC 3.2.8
// Send Product ID as string  Make*Model*SerialNumber*UnitNumber*  (must be separated by astericks)
void rvcan_SendProductID(uint8_t* MakeModelSnUnit)
{
    uint16_t ndata = strlen((char*)MakeModelSnUnit);

    LOG(SS_RVC, SV_INFO, "SendProductID: %s", MakeModelSnUnit);
    J1939_SendMultiPacketMessage(RVC_DGN_PRODUCT_IDENTIFICATION, ndata, MakeModelSnUnit);
}

// ----------------------------------------------------------------------
// RVC 6.4.2
// Send Date/Time status
void rvcan_Send_DateTimeStatus(uint8_t yearOffset,  // 0 = 2000, 1=2001, etc 
                               uint8_t month,       // 1=Jan, 2=Feb, etc 
                               uint8_t date,        // 0-31 
                               uint8_t dayOfWeek,   // 1=Sun, 2=Mon, etc
                               uint8_t hour,        // 0-23  0=12AM  12=12Noon
                               uint8_t minute,      // 0-59
                               uint8_t second,      // 0-59
                               uint8_t timeZone     // 0=GMT hours offset EST=5 
                               )
{
    CAN_DATA data[8];
    CAN_LEN  ndata = sizeof(data);

    data[0] = yearOffset;
    data[1] = month;
    data[2] = date;
    data[3] = dayOfWeek;
    data[4] = hour;
    data[5] = minute;
    data[6] = second;
    data[7] = timeZone;

    J1939_SendMessage(RVC_DGN_DATE_TIME_STATUS, ndata, data);
}

// ----------------------------------------------------------------------
// reset communication statistics
void rvcan_ResetCommStats()
{
    LOG(SS_INVCMD, SV_INFO, "Reset Comm Stats");

    // clear state counters and flags
    g_can.rvcRxErrCount      = 0;
    g_can.rvcTxErrCount      = 0;
    g_can.rvcTxFrameCount    = 0;  
    g_can.rvcRxFrameCount    = 0;  
    g_can.rvcBusOffErr       = 0;     
    g_can.rvcRxFramesDropped = 0;
    g_can.rvcTxFramesDropped = 0;
}

// ----------------------------------------------------------------------
// RVC 6.2.1  pg 32
void rvcan_GeneralReset(uint8_t isReboot,           // 0=no, 1=reboot cpu
                        uint8_t isClearFaults,      // 0=no, 1=clear faults
                        uint8_t isRestoreDefaults,  // 0=no, 1=restore to default values
                        uint8_t isResetCommStats)   // 0=no, 1=reset communication statistics
{
    LOG(SS_RVC, SV_INFO,"GenReset(reboot=%u clrFaults=%u rstDefaults=%u resetComm=%u)",
                        (int)isReboot, (int)isClearFaults, (int)isRestoreDefaults, isResetCommStats);

