MJBina/LPC/dsPIC/src/common/CAN/rv_can.c
    if (isClearFaults)     inv_ClearFaults();
    if (isRestoreDefaults) inv_RestoreToDefaults();
    if (isResetCommStats)  rvcan_ResetCommStats();
    J1939_SendAck(RVC_DGN_GENERAL_RESET);
    if (isReboot) inv_Reboot();
}

// ----------------------------------------------------------------------
// RVC 6.2.4  pg 36
void rvcan_SendInstanceStatus()
{
    CAN_DATA data[sizeof(RVCS_INSTANCE_STATUS)];
    CAN_LEN  ndata = sizeof(data);

    inv_GetInstStatus((RVCS_INSTANCE_STATUS*)&data[0]);

    LOGX(SS_RVC, SV_INFO, "SendInstStat: ", data, ndata);

    J1939_SendMessage(RVC_DGN_INSTANCE_STATUS, ndata, data);
}

// ----------------------------------------------------------------------
// RVC 6.2.4  pg 34
void rvcan_InstanceAssignment(uint8_t deviceType, uint8_t baseInstance,uint8_t maxInstance,
                              uint16_t baseIntAddr,uint16_t maxIntAddr)
{
    LOG(SS_RVC, SV_INFO,"instanceAssign(devtype=%u baseInst=%u maxInst=%u baseIntAddr=%u maxIntAddr=%u)",
                        (int)deviceType, (int)baseInstance, (int)maxInstance, (int)baseIntAddr, (int)maxIntAddr);
    // TODO needs work
    rvcan_SendInstanceStatus();
}

// ----------------------------------------------------------------------
//      C O M M U N I C A T I O N S   S T A T U S    M E S S A G E S
// ----------------------------------------------------------------------

// RVC 6.6.2
// Send Comm Status 1
void rvcan_SendCommStatus1()
{
    CAN_DATA data[8];
    CAN_LEN  ndata = sizeof(data);
    uint32_t timerCount = GetSysTicks();

    data[0] = (uint8_t)(timerCount    );
    data[1] = (uint8_t)(timerCount>> 8);
    data[2] = (uint8_t)(timerCount>>16);
    data[3] = (uint8_t)(timerCount>>24);
    data[4] = LOBYTE(g_can.rvcRxErrCount);
    data[5] = HIBYTE(g_can.rvcRxErrCount);
    data[6] = LOBYTE(g_can.rvcTxErrCount);
    data[7] = HIBYTE(g_can.rvcTxErrCount);

    LOGX(SS_RVC, SV_INFO, "SendCommStatus1: ", data, ndata);

    J1939_SendMessage(RVC_DGN_COMMUNICATION_STATUS_1, ndata, data);
}

// ----------------------------------------------------------------------
// RVC 6.6.3
// Send Comm Status 2
void rvcan_SendCommStatus2()
{
    CAN_DATA data[8];
    CAN_LEN  ndata = sizeof(data);

    data[0] = (uint8_t)(g_can.rvcTxFrameCount    );
    data[1] = (uint8_t)(g_can.rvcTxFrameCount>> 8);
    data[2] = (uint8_t)(g_can.rvcTxFrameCount>>16);
    data[3] = (uint8_t)(g_can.rvcTxFrameCount>>24);
    data[4] = (uint8_t)(g_can.rvcRxFrameCount    );
    data[5] = (uint8_t)(g_can.rvcRxFrameCount>> 8);
    data[6] = (uint8_t)(g_can.rvcRxFrameCount>>16);
    data[7] = (uint8_t)(g_can.rvcRxFrameCount>>24);

    LOGX(SS_RVC, SV_INFO, "SendCommStatus2: ", data, ndata);

    J1939_SendMessage(RVC_DGN_COMMUNICATION_STATUS_2, ndata, data);
}

// ----------------------------------------------------------------------
// RVC 6.6.4
// Send Comm Status 3
void rvcan_SendCommStatus3()
{
    CAN_DATA data[6];
    CAN_LEN  ndata = sizeof(data);

    data[0] = LOBYTE(g_can.rvcBusOffErr);
    data[1] = HIBYTE(g_can.rvcBusOffErr);
    data[2] = LOBYTE(g_can.rvcRxFrameCount);
    data[3] = HIBYTE(g_can.rvcRxFrameCount);
    data[4] = LOBYTE(g_can.rvcTxFrameCount);
    data[5] = HIBYTE(g_can.rvcTxFrameCount);

    LOGX(SS_RVC, SV_INFO, "SendCommStatus3: ", data, ndata);

    J1939_SendMessage(RVC_DGN_COMMUNICATION_STATUS_3, ndata, data);
}

// ----------------------------------------------------------------------
//            D C   S O U R C E   S T A T U S   N E S S A G E S
// ----------------------------------------------------------------------

//  ref:    RVC 6.5.2  pg 40
//  Name:   DC_SOURCE_STATUS_1
//  DGN:    0x1FFFD
void rvcan_SendDcSourceStatus1()
{
    CAN_DATA data[sizeof(RVCS_DC_SOURCE_STATUS_1)];
    CAN_LEN  ndata = sizeof(data);

    inv_GetDcSourceStatus1((RVCS_DC_SOURCE_STATUS_1*)&data[0]);

    LOGX(SS_RVC, SV_INFO, "SendDcSrcStat1: ", data, ndata);

    J1939_SendMessage(RVC_DGN_DC_SOURCE_STATUS_1, ndata, data);
}

// ----------------------------------------------------------------------
// RVC 6.5.3  pg 41
void rvcan_SendDcSourceStatus2()
{
    CAN_DATA data[sizeof(RVCS_DC_SOURCE_STATUS_2)+1];
    CAN_LEN  ndata = sizeof(data);

    data[0] = g_can.MyInstance;
    inv_GetDcSourceStatus2((RVCS_DC_SOURCE_STATUS_2*)&data[1]);

    LOGX(SS_RVC, SV_INFO, "SendDcSrcStat2: ", data, ndata);

    J1939_SendMessage(RVC_DGN_DC_SOURCE_STATUS_2, ndata, data);
}

// ----------------------------------------------------------------------
// RVC 6.5.3  pg 41
void rvcan_SendDcSourceStatus3()
{
    CAN_DATA data[sizeof(RVCS_DC_SOURCE_STATUS_3)+1];
    CAN_LEN  ndata = sizeof(data);

    data[0] = g_can.MyInstance;
    inv_GetDcSourceStatus3((RVCS_DC_SOURCE_STATUS_3*)&data[1]);

    LOGX(SS_RVC, SV_INFO, "SendDcSrcStat3: ", data, ndata);

    J1939_SendMessage(RVC_DGN_DC_SOURCE_STATUS_3, ndata, data);
}

// ----------------------------------------------------------------------
//             I N V E R T E R   S T A T U S    M E S S A G E S
// ----------------------------------------------------------------------

//  Name:   INVERTER_STATUS
//  DGN:    0x1FFD4
//  ref:    RVC 6.20.8  pg 100
void rvcan_SendInverterStatus()
{
    CAN_DATA data[sizeof(RVCS_INV_STATUS)+1];
    CAN_LEN  ndata = sizeof(data);

    data[0] = g_can.MyInstance;
    data[1] = inv_GetRvcStatus();
    data[2] = (inv_GetBatteryTempSensorPresent()?1:0) + (IsInvLoadSenseEn()?4:0);

    LOGX(SS_RVC, SV_INFO, "SendInvStat: ", data, ndata);

    J1939_SendMessage(RVC_DGN_INVERTER_STATUS, ndata, data);
}

// ----------------------------------------------------------------------
// RVC 6.20.10  pg 101
void rvcan_SendInverterConfigStatus1()
{
    CAN_DATA data[sizeof(RVCS_INV_CFG_STATUS1)+1];
    CAN_LEN  ndata = sizeof(data);

    data[0] = g_can.MyInstance;
    inv_GetConfigStatus1((RVCS_INV_CFG_STATUS1*)&data[1]);

    LOGX(SS_RVC, SV_INFO, "SendInvCfgStat1: ", data, ndata);

    J1939_SendMessage(RVC_DGN_INVERTER_CONFIGURATION_STATUS_1, ndata, data);
}

// ----------------------------------------------------------------------
// RVC 6.20.11  pg 102
void rvcan_SendInverterConfigStatus2()
{
    CAN_DATA data[sizeof(RVCS_INV_CFG_STATUS2)+1];
    CAN_LEN  ndata = sizeof(data);

    data[0] = g_can.MyInstance;
    inv_GetConfigStatus2((RVCS_INV_CFG_STATUS2*)&data[1]);

    LOGX(SS_RVC, SV_INFO, "SendInvCfgStat2: ", data, ndata);

