MJBina/LPC/dsPIC/src/common/CAN/rv_can.c
    J1939_SendMessage(RVC_DGN_INVERTER_CONFIGURATION_STATUS_2, ndata, data);
}

// ----------------------------------------------------------------------
// RVC 6.20.18  pg 106
void rvcan_SendInverterDcStatus()
{
    CAN_DATA data[sizeof(RVCS_INV_DC_STATUS)+1];
    CAN_LEN  ndata = sizeof(data);

    data[0] = g_can.MyInstance;
    inv_GetDcStatus((RVCS_INV_DC_STATUS*)&data[1]);

    LOGX(SS_RVC, SV_INFO, "SendInvDcStat: ", data, ndata);

    J1939_SendMessage(RVC_DGN_INVERTER_DC_STATUS, ndata, data);
}

// ----------------------------------------------------------------------
// RVC 6.1.6  pg 30
void rvcan_SendInverterAcFaultCfgStatus1()
{
    CAN_DATA data[sizeof(RVCS_AC_FAULT_STATUS_1)+1];
    CAN_LEN  ndata = sizeof(data);

    data[0] = g_can.MyInstance;
    inv_GetAcFaultStatus1((RVCS_AC_FAULT_STATUS_1*)&data[1]);

    LOGX(SS_RVC, SV_INFO, "SendInvAcFaultStat1: ", data, ndata);

    J1939_SendMessage(RVC_DGN_INVERTER_ACFAULT_CONFIGURATION_STATUS_1, ndata, data);
}

// ----------------------------------------------------------------------
// RVC 6.1.7 pg 31
void rvcan_SendInverterAcFaultCfgStatus2()
{
    CAN_DATA data[sizeof(RVCS_AC_FAULT_STATUS_2)+1];
    CAN_LEN  ndata = sizeof(data);

    data[0] = g_can.MyInstance;
    inv_GetAcFaultStatus2((RVCS_AC_FAULT_STATUS_2*)&data[1]);

    LOGX(SS_RVC, SV_INFO, "SendInvAcFaultStat2: ", data, ndata);

    J1939_SendMessage(RVC_DGN_INVERTER_ACFAULT_CONFIGURATION_STATUS_2, ndata, data);
}

// ----------------------------------------------------------------------
// RVC 6.20.2  pg 98
void rvcan_SendInverterAcStatus1()
{
    CAN_DATA data[sizeof(RVCS_AC_PNT_PG1)+1];
    CAN_LEN  ndata = sizeof(data);

    data[0] = g_can.MyInstance | 0x40;  // output
    inv_GetAcStatus1((RVCS_AC_PNT_PG1*)&data[1]);

    LOGX(SS_RVC, SV_INFO, "SendInvAcStat1: ", data, ndata);

    J1939_SendMessage(RVC_DGN_INVERTER_AC_STATUS_1, ndata, data);
}

// ----------------------------------------------------------------------
// RVC 6.20.4  pg 98
void rvcan_SendInverterAcStatus2()
{
    CAN_DATA data[sizeof(RVCS_AC_PNT_PG2)+1];
    CAN_LEN  ndata = sizeof(data);

    data[0] = g_can.MyInstance;
    inv_GetAcStatus2((RVCS_AC_PNT_PG2*)&data[1]);

    LOGX(SS_RVC, SV_INFO, "SendInvAcStat2: ", data, ndata);

    J1939_SendMessage(RVC_DGN_INVERTER_AC_STATUS_2, ndata, data);
}

// ----------------------------------------------------------------------
// RVC 6.20.5  pg 99
void rvcan_SendInverterAcStatus3()
{
    CAN_DATA data[sizeof(RVCS_AC_PNT_PG3)+1];
    CAN_LEN  ndata = sizeof(data);

    data[0] = g_can.MyInstance;
    inv_GetAcStatus3((RVCS_AC_PNT_PG3*)&data[1]);

    LOGX(SS_RVC, SV_INFO, "SendInvAcStat3: ", data, ndata);

    J1939_SendMessage(RVC_DGN_INVERTER_AC_STATUS_3, ndata, data);
}

// ----------------------------------------------------------------------
// RVC 6.20.6  pg 99
void rvcan_SendInverterAcStatus4()
{
    CAN_DATA data[sizeof(RVCS_AC_PNT_PG4)+1];
    CAN_LEN  ndata = sizeof(data);

    data[0] = g_can.MyInstance;
    inv_GetAcStatus4((RVCS_AC_PNT_PG4*)&data[1]);

    LOGX(SS_RVC, SV_INFO, "SendInvAcStat4: ", data, ndata);

    J1939_SendMessage(RVC_DGN_INVERTER_AC_STATUS_4, ndata, data);
}

// ----------------------------------------------------------------------
//             C H A R G E R   S T A T U S    M E S S A G E S
// ----------------------------------------------------------------------

#ifdef OPTION_HAS_CHARGER

//  Name:   CHARGER_STATUS
//  DGN:    0x1FFC7
//  ref:    RVC 6.21.8  pg 109
void rvcan_SendChargerStatus(void)
{
    CAN_DATA data[sizeof(RVCS_CHARGER_STATUS)+1];
    CAN_LEN  ndata = sizeof(data);
    
    data[0] = g_can.MyInstance;
    chgr_GetStatusInfo((RVCS_CHARGER_STATUS*)&data[1]);

    LOGX(SS_RVC, SV_INFO, "SendChgrStatus: ", data, ndata);

    J1939_SendMessage(RVC_DGN_CHARGER_STATUS, ndata, data);
}

// ----------------------------------------------------------------------
// RVC 6.21.9  pg 110
void rvcan_SendChargerConfigStatus(void)
{
    CAN_DATA data[sizeof(RVCS_CHARGER_CFG_STATUS)+1];
    CAN_LEN  ndata = sizeof(data);

    data[0] = g_can.MyInstance;
    chgr_GetConfigStatus((RVCS_CHARGER_CFG_STATUS*)&data[1]);

    LOGX(SS_RVC, SV_INFO, "SendChgrCfgStatus: ", data, ndata);

    J1939_SendMessage(RVC_DGN_CHARGER_CONFIGURATION_STATUS, ndata, data);
}

// ----------------------------------------------------------------------
// RVC 6.21.12  pg 113
void rvcan_SendChargerConfigStatus2(void)
{
    CAN_DATA data[sizeof(RVCS_CHARGER_CFG_STATUS2)+1];
    CAN_LEN  ndata = sizeof(data);

    data[0] = g_can.MyInstance;
    chgr_GetConfigStatus2((RVCS_CHARGER_CFG_STATUS2*)&data[1]);

    LOGX(SS_RVC, SV_INFO, "SendChgrCfgStatus2: ", data, ndata);

    J1939_SendMessage(RVC_DGN_CHARGER_CONFIGURATION_STATUS_2, ndata, data);
}

// ----------------------------------------------------------------------
// RVC 6.21.14  pg 114
void rvcan_SendChargerEqualStatus(void)
{
    CAN_DATA data[sizeof(RVCS_CHARGER_EQUAL_STATUS)+1];
    CAN_LEN  ndata = sizeof(data);

    data[0] = g_can.MyInstance;
    chgr_GetEqualStatus((RVCS_CHARGER_EQUAL_STATUS*)&data[1]);

    LOGX(SS_RVC, SV_INFO, "SendChgrEqualStatus: ", data, ndata);

    J1939_SendMessage(RVC_DGN_CHARGER_EQUALIZATION_STATUS, ndata, data);
}

// ----------------------------------------------------------------------
// RVC 6.1.6  pg 30
void rvcan_SendChargerAcFaultCfgStatus1(void)
{
    CAN_DATA data[sizeof(RVCS_AC_FAULT_STATUS_1)+1];
    CAN_LEN  ndata = sizeof(data);

    data[0] = g_can.MyInstance;
    chgr_GetAcFaultStatus1((RVCS_AC_FAULT_STATUS_1*)&data[1]);

    LOGX(SS_RVC, SV_INFO, "SendChgrAcFaultStatus1: ", data, ndata);

    J1939_SendMessage(RVC_DGN_CHARGER_ACFAULT_CONFIGURATION_STATUS_1, ndata, data);
}

// ----------------------------------------------------------------------
// RVC 6.1.7 pg 31
void rvcan_SendChargerAcFaultCfgStatus2(void)
{
    CAN_DATA data[sizeof(RVCS_AC_FAULT_STATUS_2)+1];
    CAN_LEN  ndata = sizeof(data);

    data[0] = g_can.MyInstance;
    chgr_GetAcFaultStatus2((RVCS_AC_FAULT_STATUS_2*)&data[1]);

    LOGX(SS_RVC, SV_INFO, "SendChgrAcFaultStatus2: ", data, ndata);
    
    J1939_SendMessage(RVC_DGN_CHARGER_ACFAULT_CONFIGURATION_STATUS_2, ndata, data);
}

// ----------------------------------------------------------------------
// RVC 6.21.3  pg 107
void rvcan_SendChargerAcStatus1(void)
{
    CAN_DATA data[sizeof(RVCS_AC_PNT_PG1)+1];
    CAN_LEN  ndata = sizeof(data);

    data[0] = g_can.MyInstance;
    chgr_GetAcStatus1((RVCS_AC_PNT_PG1*)&data[1]);

    LOGX(SS_RVC, SV_INFO, "SendChgrAcStat1: ", data, ndata);

    J1939_SendMessage(RVC_DGN_CHARGER_AC_STATUS_1, ndata, data);
}

// ----------------------------------------------------------------------
// RVC 6.21.4  pg 108
void rvcan_SendChargerAcStatus2(void)
{
    CAN_DATA data[sizeof(RVCS_AC_PNT_PG2)+1];
    CAN_LEN  ndata = sizeof(data);

    data[0] = g_can.MyInstance;
    chgr_GetAcStatus2((RVCS_AC_PNT_PG2*)&data[1]);

