MJBina/LPC/dsPIC/src/common/CAN/rv_can.c
    LOGX(SS_RVC, SV_INFO, "SendChgrAcStat2: ", data, ndata);

    J1939_SendMessage(RVC_DGN_CHARGER_AC_STATUS_2, ndata, data);
}

// ----------------------------------------------------------------------
// RVC 6.21.5  pg 108
void rvcan_SendChargerAcStatus3(void)
{
    CAN_DATA data[sizeof(RVCS_AC_PNT_PG3)+1];
    CAN_LEN  ndata = sizeof(data);

    data[0] = g_can.MyInstance;
    chgr_GetAcStatus3((RVCS_AC_PNT_PG3*)&data[1]);

    LOGX(SS_RVC, SV_INFO, "SendChgrAcStat3: ", data, ndata);

    J1939_SendMessage(RVC_DGN_CHARGER_AC_STATUS_3, ndata, data);
}

// ----------------------------------------------------------------------
// RVC 6.21.6  pg 108
void rvcan_SendChargerAcStatus4(void)
{
    CAN_DATA data[sizeof(RVCS_AC_PNT_PG4)+1];
    CAN_LEN  ndata = sizeof(data);

    data[0] = g_can.MyInstance;
    chgr_GetAcStatus4((RVCS_AC_PNT_PG4*)&data[1]);

    LOGX(SS_RVC, SV_INFO, "SendChgAcStat4: ", data, ndata);

    J1939_SendMessage(RVC_DGN_CHARGER_AC_STATUS_4, ndata, data);
}

#endif // OPTION_HAS_CHARGER

// ----------------------------------------------------------------------
//           I N V E R T E R   C O M M A N D    H A N D L E R S
// ----------------------------------------------------------------------

//  1FFD3h	INVERTER_COMMAND
//  ref:    RVC 6.20.9  pg 100
void rvcan_InverterCmd(uint8_t enableFlags, uint8_t startupFlags)
{
    int enInv,    enLdSns,    enPassThru;
    int startInv, startLdSns, startPassThru;

    LOG(SS_RVC, SV_INFO,"InvCmd: enable=0x%02X enStartup=0x%02X", enableFlags, startupFlags);

    // decode enable flags
    enInv      = (enableFlags     ) & 0x3;
    enLdSns    = (enableFlags >> 2) & 0x3;
    enPassThru = (enableFlags >> 4) & 0x3;

    // decode startup flags 2or3=dont change
    startInv      = (startupFlags     ) & 0x3;
    startLdSns    = (startupFlags >> 2) & 0x3;
    startPassThru = (startupFlags >> 4) & 0x3;

    //  These settings take affect immediately
    if (!(enInv      & 2)) dev_SetInverterEnabled (enInv      & 1);
    if (!(enLdSns    & 2)) inv_SetLoadSenseEnabled(enLdSns	& 1);
    if (!(enPassThru & 2)) dev_SetPassThruEnabled (enPassThru & 1);
         
    //  These settings take affect on startup
    if (!(startInv      & 2)) dev_SetInverterEnabledOnStartup (startInv      & 1);
    if (!(startLdSns    & 2)) inv_SetLoadSenseEnabledOnStartup(startLdSns    & 1);
    if (!(startPassThru & 2)) dev_SetPassThruEnabledOnStartup(startPassThru & 1);

    // send back status
    rvcan_SendInverterStatus();
}

// ----------------------------------------------------------------------
//	1FFD0h	INVERTER_CONFIGURATION_COMMAND_1	
// 	ref:	RVC 6.20.13a (6.20.12a in prior revision)
//	
void rvcan_InverterCfgCmd1(uint16_t loadSenseThresh,    // power threshold in watts
                           uint16_t loadSenseInterval,  // seconds
                           uint16_t dcSrcShutdownMin)   // volts
{
    LOG(SS_RVC, SV_INFO,"InvCfgCmd1(ldSnsTh=%u ldSnsInt=%u dcMin=%u)",
                          loadSenseThresh, loadSenseInterval, dcSrcShutdownMin);

    // TODO use settings
    rvcan_SendInverterConfigStatus1();
}

// ----------------------------------------------------------------------
// RVC 6.20.13  pg 103
void rvcan_InverterCfgCmd2(uint16_t dcSrcShutdownMax,   // volts
                           uint16_t dcSrcWarnMin,       // volts
                           uint16_t dcSrcWarnMax)       // volts
{
    LOG(SS_RVC, SV_INFO,"InvCfgCmd2(dcMax=%u dcWarnMin=%u dcWarnMax=%u)",
                        (int)dcSrcShutdownMax, (int)dcSrcWarnMin, (int)dcSrcWarnMax);

    // TODO use settings
    rvcan_SendInverterConfigStatus2();
}

// ----------------------------------------------------------------------
// RVC 6.1.7  pg 31
void rvcan_InverterAcFaultCtrlCfgCmd1(RVCS_AC_FAULT_STATUS_1* cfg)
{
    LOG(SS_RVC, SV_INFO,"InvAcFaultCtrlCfgCmd1(xLoV=%u loV=%u hiV=%u xHiV=%u eqSec=%u, bypass=%u)",
                (int)cfg->extremeLowVoltage,  (int)cfg->lowVoltage,          (int)cfg->highVoltage,
                (int)cfg->extremeHighVoltage, (int)cfg->equalizationSeconds, (int)cfg->bypassMode);

    // TODO use settings
    rvcan_SendInverterAcFaultCfgStatus1();
}

// ----------------------------------------------------------------------
// RVC 6.1.7 pg 31
void rvcan_InverterAcFaultCtrlCfgCmd2(RVCS_AC_FAULT_STATUS_2* cfg)
{
    LOG(SS_RVC, SV_INFO,"InvAcFaultCtrlCfgCmd1(hiFreq=%u loFreq=%u",
                (int)cfg->hiFreqLimit,  (int)cfg->loFreqLimit);

    // TODO use settings
    rvcan_SendInverterAcFaultCfgStatus2();
}

// ----------------------------------------------------------------------
//           C H A R G E R   C O M M A N D    H A N D L E R S
// ----------------------------------------------------------------------

#ifdef OPTION_HAS_CHARGER

//  Name:   CHARGER_COMMAND
//  DGN:    0x1FFCB
//  ref:    RVC 6.21.10  pg 111
//  status: 0=Disable (charger), 1=Enable charger, 2=Start equalization 
//			(bitmapped) 3=Enable Charger + Start equalization >=4= no change
//  startupEnable: 0=disable, 1=enable, 2or3=dont change

void rvcan_ChargerCmd(uint8_t status,     // 0=off, 1=on, >1=dont change
                      uint8_t startupEnable)   // 0=charger disabled, 1=charger enabled, >1=dont change
{
//    LOG(SS_RVC, SV_INFO,"ChgrCmd: status=%u startupEnable=%u", (int)status, (int)startupEnable);

	
    // decode 'status' flags 2 or 3 = dont change
	if((status & 0x02) != 0x02)		Device.status.chgr_enable_can = (status & 0x01)? 1:0;
	
	if((status & 0x08) != 0x08)
	{
		g_nvm.settings.chgr.eq_request = Chgr.config.eq_request = (status & 0x04)? 1:0;;
        nvm_SetDirty();
	}

    // enable on start-up
    if (startupEnable < 2) // 2 or 3 = don't change
    {   
        g_nvm.settings.dev.chgr_enabled = Device.config.chgr_enabled = startupEnable;
        nvm_SetDirty();
    }
	
    LOG(SS_SYS, SV_INFO,"ChgrCmd: status=0x%02X, en:%d, eq:%d ", 
		(int)status, 
		(int)IsChgrEnabled(),
		(int)IsChgrCfgEqRequest() );
//    LOG(SS_SYS, SV_INFO,"ChgrCmd: status=%u startupEnable=%u", (int)status, (int)startupEnable);

