MJBina/LPC/dsPIC/src/common/CAN/rv_can.c
    rvcan_SendChargerStatus();
}

// ----------------------------------------------------------------------
//	Name: 	CHARGER_CONFIGURATION_COMMAND
//	DGN:	0x1FFC4
// 	Ref:	RVC 6.21.11
void rvcan_ChargerCfgCmd(uint8_t  chargingAlgorithm,    // 
                         uint8_t  chargerMode,          // 
                         uint8_t  batterySensePresent,  // 0=no, 1=yes
                         uint8_t  installationLine,     // 0=line1, 1=line2
                         uint16_t batteryBankSize,      // amp-hours; resolution 1 amp-hour
                         uint16_t batteryType,          // 
                         uint8_t  maxChargingCurrent)   // amps
{
    LOG(SS_RVC, SV_INFO,"ChgrCfgCmd(alg=%u mode=%u battSns=%u install=%u battSize=%u battType=%u maxCharge=%u)",
                        (int)chargingAlgorithm, (int)chargerMode,     (int)batterySensePresent,
                        (int)installationLine,  (int)batteryBankSize, (int)batteryType, (int)maxChargingCurrent); 

    chgr_SetCfgCmd(chargingAlgorithm,   
                   chargerMode,         
                   batterySensePresent, 
                   installationLine,    
                   batteryBankSize,     
                   batteryType,         
                   maxChargingCurrent);  

    rvcan_SendChargerConfigStatus();
}

// ----------------------------------------------------------------------
// RVC 6.21.13  pg 113
void rvcan_ChargerCfgCmd2(uint8_t  chargePercent,       // max charge current; percent
                          uint8_t  chargeRatePercent,   // charge rate limit; percent of bank size
                          uint8_t  breakerSize)         // amps
{
    LOG(SS_RVC, SV_INFO,"ChgrCfgCmd2(alg=%u mode=%u battSns=%u install=%u battSize=%u battType=%u maxCharge=%u)",
                        (int)chargePercent, (int)chargeRatePercent, (int)breakerSize);

    chgr_SetCfgCmd2(chargePercent,chargeRatePercent,breakerSize);

    rvcan_SendChargerConfigStatus2();
}

// ----------------------------------------------------------------------
// RVC 6.21.16  pg 115
void rvcan_ChargerEqualizationCmd(uint16_t  equalizationVolts,      // equalization voltage
                                  uint16_t  equalizationMinutes)    // equalization time in minutes
{
    LOG(SS_RVC, SV_INFO,"ChgrEqualCmd(eqVolts=%u eqMinutes=%u)",
                        (int)equalizationVolts, (int)equalizationMinutes);

    // TODO use settings
    rvcan_SendChargerEqualStatus();
}

// ----------------------------------------------------------------------
// RVC 6.1.7  pg 31
void rvcan_ChargerAcFaultCtrlCfgCmd1(RVCS_AC_FAULT_STATUS_1* cfg)
{
    LOG(SS_RVC, SV_INFO,"ChgrAcFaultCtrlCfgCmd1(xLoV=%u loV=%u hiV=%u xHiV=%u eqSec=%u, bypass=%u)",
                (int)cfg->extremeLowVoltage,  (int)cfg->lowVoltage,          (int)cfg->highVoltage,
                (int)cfg->extremeHighVoltage, (int)cfg->equalizationSeconds, (int)cfg->bypassMode);

    // TODO use settings
    rvcan_SendChargerAcFaultCfgStatus1();
}

// ----------------------------------------------------------------------
// RVC 6.1.7 pg 31
void rvcan_ChargerAcFaultCtrlCfgCmd2(RVCS_AC_FAULT_STATUS_2* cfg)
{
    LOG(SS_RVC, SV_INFO,": ChgrAcFaultCtrlCfgCmd1(hiFreq=%u loFreq=%u",
                (int)cfg->hiFreqLimit,  (int)cfg->loFreqLimit);

    // TODO use settings
    rvcan_SendChargerAcFaultCfgStatus2();
}

#endif // OPTION_HAS_CHARGER

// ----------------------------------------------------------------------
//           P R O P R I E T A R Y    M E S S A G E S
// ----------------------------------------------------------------------

// Proprietary Magnum message
void rvcan_SendPropInvStatus(uint8_t loDGN)
{
    CAN_DATA data[3];
    CAN_LEN  ndata = 3;
    CAN_DGN  dgn;

    dgn = 0xEF00 | loDGN;

    // Cory Rietz - Tech Support at Silverleaf
    // The HMS360 you are using doesn't support the 
    // new Magnum Bridge proprietary messages.
    // We have our own Magnum interface that produces a different set
    // of proprietary messages that the HMS360 is asking for. 

    // proprietary inverter temperature message
    data[0] = 0xE2;
    data[1] = RVC_NOT_SUPPORTED_8BIT;
  #if IS_PCB_LPC 
    data[2] = RVC_NOT_SUPPORTED_8BIT;
  #else
    data[2] = HeatSinkTempC();
  #endif
    LOGX(SS_RVC, SV_INFO, "SendPropInvTemp: ", data, ndata);
    J1939_SendMessage(dgn, ndata, data);

    // proprietary inverter version message
    data[0] = 0xE4;
    data[1] = 40; // magnum model
    data[2] = 12; // version in 0.1 increments
    LOGX(SS_RVC, SV_INFO, "SendPropInvVersion: ", data, ndata);
    J1939_SendMessage(dgn, ndata, data);

}


// ----------------------------------------------------------------------
//             R V C    M E S S A G E    D I S P A T C H E R
// ----------------------------------------------------------------------
// check if CAN message is a RV-C message and process it
// returns: 0=not for us, 1=dispatched
int16_t rvcan_Dispatcher(CAN_MSG* msg)
{
    CAN_DATA outData[SENFLD_MAX_BYTES];
    CAN_LEN  ndata;
    int16_t  rc = 0;    // assume dispatched
    uint32_t dgn;

    // must be extended message
    if (msg->frameType != CAN_FRAME_EXT) return(0);

    dgn = can_DGN(msg);
    switch( dgn )
    {
        case SENSATA_CUSTOM_SET_FIELD_DGN:
            sen_SetField(msg->data);
            break;

        case SENSATA_CUSTOM_GET_FIELD_DGN:
            // get data for requested field
            if (!IsRvcCmdForMe(msg->data[0])) break;
            if (sen_GetField(msg->data, outData, &ndata)) break;
            // send CAN response to host
            if (outData[3] == SENFLD_TYPE_STRING)  // string is the odd ball
                J1939_SendMultiPacketMessage(SENSATA_CUSTOM_GET_FIELD_RSP_DGN, ndata, outData);
            else
                J1939_SendMessage(SENSATA_CUSTOM_GET_FIELD_RSP_DGN, ndata, outData);
            break;

        case RVC_DGN_GENERAL_RESET: 
            if (!IsRvcCmdForMe(msg->data[1])) break;    // Sensata extension
            rvcan_GeneralReset((msg->data[0] & (3<<0)) ? 1 : 0,   // 0=no, 1=reboot cpu
                               (msg->data[0] & (3<<2)) ? 1 : 0,   // 0=no, 1=clear faults
                               (msg->data[0] & (3<<4)) ? 1 : 0,   // 0=no, 1=restore to default values
                               (msg->data[0] & (3<<6)) ? 1 : 0);  // 0=no, 1=reset communication statistics

            break;
        case RVC_DGN_INVERTER_COMMAND:
            if (!IsRvcCmdForMe(msg->data[0])) break;
            rvcan_InverterCmd( msg->data[1], msg->data[7] );
            break;

