MJBina/LPC/dsPIC/src/common/CAN/rv_can.c
        case RVC_DGN_INVERTER_CONFIGURATION_COMMAND_1:
            if (!IsRvcCmdForMe(msg->data[0])) break;
            rvcan_InverterCfgCmd1( MKWORD(msg->data[1],msg->data[2]),
                                   MKWORD(msg->data[3],msg->data[4]),
                                   MKWORD(msg->data[5],msg->data[6]) );
            break;

        case RVC_DGN_INVERTER_CONFIGURATION_COMMAND_2:
            if (!IsRvcCmdForMe(msg->data[0])) break;
            rvcan_InverterCfgCmd2( MKWORD(msg->data[1],msg->data[2]),
                                   MKWORD(msg->data[3],msg->data[4]),
                                   MKWORD(msg->data[5],msg->data[6]) );
            break;

        case RVC_DGN_INVERTER_ACFAULT_CONFIGURATION_COMMAND_1:        
            if (!IsRvcCmdForMe(msg->data[0])) break;
            rvcan_InverterAcFaultCtrlCfgCmd1((RVCS_AC_FAULT_STATUS_1*)&msg->data[1]);
            break;

        case RVC_DGN_INVERTER_ACFAULT_CONFIGURATION_COMMAND_2:        
            if (!IsRvcCmdForMe(msg->data[0])) break;
            rvcan_InverterAcFaultCtrlCfgCmd2((RVCS_AC_FAULT_STATUS_2*)&msg->data[1]);
            break;

    #ifdef OPTION_HAS_CHARGER
        case RVC_DGN_CHARGER_COMMAND:
            if (!IsRvcCmdForMe(msg->data[0])) break;
            rvcan_ChargerCmd(msg->data[1],      // 0=off, 1=on, 2=start equalization
                             msg->data[2] & 3); // 0=off, 1=on, ignore all others
            break;

        case RVC_DGN_CHARGER_CONFIGURATION_COMMAND:
            if (!IsRvcCmdForMe(msg->data[0])) break;
            rvcan_ChargerCfgCmd(msg->data[1],                       // charging algorithm
                                msg->data[2],                       // charger mode
                                msg->data[3] & 3,                   // battery temp sensor
                               (msg->data[3]>>2) & 3,               // install line
                                MKWORD(msg->data[4],msg->data[5]),  // battery size
                                msg->data[6],                       // battery type
                                msg->data[7]);                      // max charge amps
            break;

        case RVC_DGN_CHARGER_CONFIGURATION_COMMAND_2:                 
            if (!IsRvcCmdForMe(msg->data[0])) break;
            rvcan_ChargerCfgCmd2(msg->data[1],              // charge percent
                                 msg->data[2],              // charge rate percent
                                 msg->data[3]);             // breakerSize
            break;

        case RVC_DGN_CHARGER_EQUALIZATION_CONFIGURATION_COMMAND:      
            if (!IsRvcCmdForMe(msg->data[0])) break;
            rvcan_ChargerEqualizationCmd(MKWORD(msg->data[1],msg->data[2]),     // voltage
                                         MKWORD(msg->data[3],msg->data[4]));    // minutes
            break;

        case RVC_DGN_CHARGER_ACFAULT_CONFIGURATION_COMMAND_1:         
            if (!IsRvcCmdForMe(msg->data[0])) break;
            rvcan_ChargerAcFaultCtrlCfgCmd1((RVCS_AC_FAULT_STATUS_1*)&msg->data[1]);
            break;

        case RVC_DGN_CHARGER_ACFAULT_CONFIGURATION_COMMAND_2:
            if (!IsRvcCmdForMe(msg->data[0])) break;
            rvcan_ChargerAcFaultCtrlCfgCmd2((RVCS_AC_FAULT_STATUS_2*)&msg->data[1]);
            break;
     #endif // OPTION_HAS_CHARGER

        case RVC_DGN_INSTANCE_ASSIGNMENT:
            rvcan_InstanceAssignment(msg->data[0],msg->data[1],msg->data[2],
                              MKWORD(msg->data[3],msg->data[4]),
                              MKWORD(msg->data[5],msg->data[6]) );
            break;

        case RVC_DGN_PROP_MAGNUM_INVERTER_STATUS:
            rvcan_SendPropInvStatus(msg->jid.SourceAddress);
            break;
        /*
        // not received, but sent

        // house keeping
        case RVC_DGN_INSTANCE_STATUS:                                 

        // communications
        case RVC_DGN_COMMUNICATION_STATUS_1:
        case RVC_DGN_COMMUNICATION_STATUS_2:
        case RVC_DGN_COMMUNICATION_STATUS_3:

        // inverter status
        case RVC_DGN_INVERTER_AC_STATUS_1:
        case RVC_DGN_INVERTER_AC_STATUS_2:
        case RVC_DGN_INVERTER_AC_STATUS_3:
        case RVC_DGN_INVERTER_STATUS:
        case RVC_DGN_INVERTER_CONFIGURATION_STATUS_1:
        case RVC_DGN_INVERTER_CONFIGURATION_STATUS_2:
        case RVC_DGN_INVERTER_STATISTICS_STATUS:                      
        case RVC_DGN_INVERTER_APS_STATUS:                             
        case RVC_DGN_INVERTER_DCBUS_STATUS:                           
        case RVC_DGN_INVERTER_OPS_STATUS:                             
        case RVC_DGN_INVERTER_AC_STATUS_4:                            
        case RVC_DGN_INVERTER_ACFAULT_CONFIGURATION_STATUS_1:         
        case RVC_DGN_INVERTER_ACFAULT_CONFIGURATION_STATUS_2:         
        case RVC_DGN_INVERTER_DC_STATUS:                              

        // charger status
        case RVC_DGN_CHARGER_AC_STATUS_1:                             
        case RVC_DGN_CHARGER_AC_STATUS_2:                             
        case RVC_DGN_CHARGER_AC_STATUS_3:                             
        case RVC_DGN_CHARGER_STATUS:                                  
        case RVC_DGN_CHARGER_CONFIGURATION_STATUS:                    
        case RVC_DGN_CHARGER_APS_STATUS:                              
        case RVC_DGN_CHARGER_DCBUS_STATUS:                            
        case RVC_DGN_CHARGER_OPS_STATUS:                              
        case RVC_DGN_CHARGER_EQUALIZATION_STATUS:                     
        case RVC_DGN_CHARGER_EQUALIZATION_CONFIGURATION_STATUS:       
        case RVC_DGN_CHARGER_CONFIGURATION_STATUS_2:                  
        case RVC_DGN_CHARGER_AC_STATUS_4:                             
        case RVC_DGN_CHARGER_ACFAULT_CONFIGURATION_STATUS_1:          
        case RVC_DGN_CHARGER_ACFAULT_CONFIGURATION_STATUS_2:          

        // dc source
        case RVC_DGN_DC_SOURCE_STATUS_1:
        case RVC_DGN_DC_SOURCE_STATUS_2:
        case RVC_DGN_DC_SOURCE_STATUS_3:

        // loads
        case RVC_DGN_AC_LOAD_STATUS_2:                                
        case RVC_DGN_DC_LOAD_STATUS_2:                                

        // date-time
        case RVC_DGN_SET_DATE_TIME_COMMAND:     // LPC has no real-time-clock                                                    
        case RVC_DGN_DATE_TIME_STATUS:          // LPC has no real-time-clock                            
        case RVC_DGN_PROPRIETARY_INSTANCE:
        */

        default:
            rc = 0; // not dispatched
            break;
    } // switch
    return(rc);
}

// <><><><><><><><><><><><><> rv_can.c <><><><><><><><><><><><><><><><><><><><><><>
